Interage/IntegracaoSascar/IntegracaoSascar/IntegracaoSascar/bin/Debug/modeloxml/ObterMacroTd50TmcdDetalhado.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.integra.sascar.com.br/">
  <soapenv:Header/>
  <soapenv:Body>
    <ws:obterMacroTd50Tmcd>
      <usuario>@usuario</usuario>
      <senha>@senha</senha>
      <tipoTeclado>@tipoTeclado</tipoTeclado>
    </ws:obterMacroTd50Tmcd>
  </soapenv:Body>
</soapenv:Envelope>